{"keras_version": "1.0.7", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_1", "dim_ordering": "tf", "activation": "linear", "input_dtype": "float32", "trainable": true, "border_mode": "same", "batch_input_shape": [null, 64, 64, 3], "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 4, "nb_col": 4, "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "W_constraint": null, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [3, 3], "pool_size": [3, 3], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "subsample": [1, 1], "trainable": true, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "nb_filter": 36, "b_constraint": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_1", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "subsample": [1, 1], "trainable": true, "border_mode": "same", "b_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_row": 4, "nb_col": 4, "init": "glorot_uniform", "nb_filter": 48, "b_constraint": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "subsample": [1, 1], "trainable": true, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "nb_row": 2, "nb_col": 2, "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_3", "trainable": true}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_2", "dim_ordering": "tf", "strides": [1, 1], "pool_size": [1, 1], "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "output_dim": 512, "input_dim": null, "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_4", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "output_dim": 64, "input_dim": null, "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_regularizer": null, "output_dim": 1, "input_dim": null, "activation": "linear", "trainable": true, "W_constraint": null, "b_regularizer": null, "name": "dense_3", "activity_regularizer": null, "init": "glorot_uniform", "b_constraint": null}}]}